
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>试题管理模块 · Easy Testing Documentation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-zealar/test.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bootstrap-callout/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="exams.html" />
    
    
    <link rel="prev" href="teachers.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Welcome!
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">教师使用手册</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="deployment.html">
            
                <a href="deployment.html">
            
                    
                    部署指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="login.html">
            
                <a href="login.html">
            
                    
                    登录界面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="structure.html">
            
                <a href="structure.html">
            
                    
                    基本界面结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="students.html">
            
                <a href="students.html">
            
                    
                    学生管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="teachers.html">
            
                <a href="teachers.html">
            
                    
                    教师管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.7" data-path="questions.html">
            
                <a href="questions.html">
            
                    
                    试题管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="exams.html">
            
                <a href="exams.html">
            
                    
                    考试管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">学生使用手册</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../student_guide/structure.md">
            
                <span>
            
                    
                    基本界面结构
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">设计文档</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../design/introduction.html">
            
                <a href="../design/introduction.html">
            
                    
                    系统总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../design/database.html">
            
                <a href="../design/database.html">
            
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../design/api.html">
            
                <a href="../design/api.html">
            
                    
                    接口文档
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../design/server.html">
            
                <a href="../design/server.html">
            
                    
                    服务端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="../design/teacher_client.html">
            
                <a href="../design/teacher_client.html">
            
                    
                    教师客户端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.6" data-path="../design/student_client.html">
            
                <a href="../design/student_client.html">
            
                    
                    学生客户端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.7" data-path="../design/build.html">
            
                <a href="../design/build.html">
            
                    
                    构建指南
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >试题管理模块</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><em>&#x8BD5;&#x9898;&#x7BA1;&#x7406;</em>&#x6A21;&#x5757;&#x5305;&#x62EC;&#x4E94;&#x4E2A;&#x9875;&#x9762;&#xFF08;&#x5BF9;&#x5E94;&#x4E8E;&#x4E94;&#x79CD;&#x9898;&#x578B;&#xFF09;&#xFF1A;
<em>&#x5355;&#x9009;&#x9898;</em>&#x3001;<em>&#x591A;&#x9009;&#x9898;</em>&#x3001;<em>&#x586B;&#x7A7A;&#x9898;</em>&#x3001;<em>&#x5224;&#x65AD;&#x9898;</em>&#x3001;<em>&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x9898;</em>&#x548C;<em>&#x7F16;&#x7A0B;&#x9898;</em>&#x3002;
&#x8FD9;&#x4E9B;&#x9875;&#x9762;&#x4E5F;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x8868;&#x683C;&#x7684;&#xFF0C;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#xFF0C;
&#x6587;&#x6863;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;<em>&#x591A;&#x9009;&#x9898;</em>&#x9875;&#x9762;&#x548C;<em>&#x7F16;&#x7A0B;&#x9898;</em>&#x9875;&#x9762;&#xFF0C;&#x5176;&#x4ED6;&#x53EF;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<h2 id="&#x591A;&#x9009;&#x9898;">&#x591A;&#x9009;&#x9898;</h2>
<p><img src="../img/teacher-maq.png" alt="maq"></p>
<p>&#x6240;&#x6709;&#x9898;&#x76EE;&#x90FD;&#x53EA;&#x652F;&#x6301;&#x6309;<em>&#x51FA;&#x9898;&#x8005;&#x5DE5;&#x53F7;</em>&#x8FDB;&#x884C;&#x641C;&#x7D22;&#xFF0C;&#x4E14;&#x540C;&#x6837;&#x53EA;&#x652F;&#x6301;&#x524D;&#x7F00;&#x68C0;&#x7D22;&#x3002;
&#x70B9;&#x51FB;<em>&#x6DFB;&#x52A0;</em>&#x6309;&#x94AE;&#x5C31;&#x4F1A;&#x5F39;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x5BF9;&#x8BDD;&#x6846;&#x3002;</p>
<p><img src="../img/teacher-create-maq.png" alt="maq-create"></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6240;&#x6709;&#x9898;&#x76EE;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;<em>&#x9898;&#x5E72;</em>&#xFF0C;
&#x9009;&#x597D;<em>&#x9009;&#x9879;&#x6570;</em>&#x540E;&#x5BF9;&#x8BDD;&#x6846;&#x8FD8;&#x4F1A;&#x8981;&#x6C42;&#x586B;&#x5199;&#x5BF9;&#x5E94;&#x6570;&#x91CF;&#x7684;&#x9009;&#x9879;&#x5185;&#x5BB9;&#x4EE5;&#x53CA;&#x6B63;&#x786E;&#x7B54;&#x6848;&#x3002;
<em>&#x9898;&#x5E72;</em>&#x548C;&#x5404;&#x4E2A;&#x9009;&#x9879;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x652F;&#x6301; Markdown&#x3002;
Markdown &#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x5BCC;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;<a href="https://www.markdownguide.org/basic-syntax/" target="_blank">&#x8FD9;&#x91CC;</a>&#x5B66;&#x4E60;&#x5176;&#x8BED;&#x6CD5;&#x3002;
&#x5BF9;&#x8BDD;&#x6846;&#x5185;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x6613;&#x7684; Markdown &#x7F16;&#x8F91;&#x5668;&#x3002;
&#x4E0A;&#x9762;&#x6709;&#x5E38;&#x7528;&#x7684;&#x8BED;&#x6CD5;&#x6309;&#x94AE;&#xFF0C;&#x53F3;&#x4E0B;&#x89D2;&#x53EF;&#x5207;&#x6362;&#x662F;&#x5426;&#x663E;&#x793A;&#x53F3;&#x4FA7;&#x7684;&#x9884;&#x89C8;&#x533A;&#xFF0C;
&#x9884;&#x89C8;&#x533A;&#x7684;&#x6548;&#x679C;&#x57FA;&#x672C;&#x4E0E;&#x5B66;&#x751F;&#x5728;&#x8003;&#x8BD5;&#x65F6;&#x770B;&#x5230;&#x7684;&#x6548;&#x679C;&#x4E00;&#x81F4;&#x3002;</p>
<div class="callout callout-info"><h4 id="&#x4E8B;&#x5148;&#x4FDD;&#x5B58;&#x597D;-markdown">&#x4E8B;&#x5148;&#x4FDD;&#x5B58;&#x597D; Markdown</h4><div><p>&#x610F;&#x5916;&#x9000;&#x51FA;&#x5BF9;&#x8BDD;&#x6846;&#x6216;&#x5BF9;&#x8BDD;&#x6846;&#x63D0;&#x4EA4;&#x5931;&#x8D25;&#x540E;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x4F1A;&#x4E22;&#x5931;&#x3002;
&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x754C;&#x9762;&#x5927;&#x5C0F;&#x53D7;&#x9650;&#xFF0C;&#x5BF9;&#x8BDD;&#x6846;&#x5B57;&#x4F53;&#x8F83;&#x5C0F;&#xFF0C;&#x4E0D;&#x9002;&#x5B9C;&#x5728;&#x6B64;&#x957F;&#x671F;&#x7F16;&#x5199;&#x9898;&#x76EE;&#x3002;
&#x6240;&#x4EE5;&#x5EFA;&#x8BAE;&#x4E8B;&#x5148;&#x4F7F;&#x7528;&#x5176;&#x4ED6; Markdown &#x7F16;&#x8F91;&#x5668;
&#xFF08;&#x4F8B;&#x5982; <a href="https://typora.io/" target="_blank">Typora</a>&#xFF09;&#x7F16;&#x5199;&#x9898;&#x76EE;&#x5E76;&#x4FDD;&#x5B58;&#xFF0C;
&#x518D;&#x5C06;&#x9898;&#x5E72;&#x7B49;&#x7C98;&#x8D34;&#x5230;&#x5BF9;&#x8BDD;&#x6846;&#x4E2D;&#xFF0C;&#x4EC5;&#x7528;&#x5185;&#x7F6E;&#x7F16;&#x8F91;&#x5668;&#x505A;&#x4E9B;&#x5C0F;&#x4FEE;&#x6539;&#x3002;</p></div></div>
<p>&#x8868;&#x683C;&#x663E;&#x793A;&#x4E86;&#x591A;&#x9009;&#x9898;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;<em>&#x51FA;&#x9898;&#x8005;&#x5DE5;&#x53F7;</em>&#x3001;<em>&#x9898;&#x5E72;</em>&#x548C;&#x5404;&#x4E2A;&#x9009;&#x9879;&#x7684;&#x5185;&#x5BB9;&#x3002;
&#x6CE8;&#x610F;&#x5230;<em>&#x9898;&#x5E72;</em>&#x7B49;&#x56E0;&#x4E3A;&#x5B57;&#x7B26;&#x8FC7;&#x591A;&#xFF0C;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x663E;&#x793A;&#xFF0C;
&#x9F20;&#x6807;&#x6307;&#x9488;&#x60AC;&#x6D6E;&#x5728;&#x5176;&#x4E0A;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x66F4;&#x591A;&#x7684;&#x6587;&#x672C;&#xFF0C;
&#x5982;&#x679C;&#x8981;&#x67E5;&#x770B;&#x5B8C;&#x6574;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x53EA;&#x80FD;&#x8FDB;&#x5165;<em>&#x7F16;&#x8F91;</em>&#x5BF9;&#x8BDD;&#x6846;&#x3002;
&#x591A;&#x9009;&#x9898;&#x7684;&#x9009;&#x9879;&#x6570;&#x91CF;&#x662F;&#x5404;&#x6709;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;<em>&#x9009;&#x9879;&#x6570;</em>&#x4E0D;&#x8DB3;&#x4E03;&#x7684;&#x9898;&#x76EE;&#xFF0C;
&#x591A;&#x4F59;&#x7684;&#x9009;&#x9879;&#x5728;&#x8868;&#x683C;&#x4E2D;&#x4EE5;&#x4E00;&#x4E2A;&#x5199;&#x7740;&#x201C;&#x65E0;&#x201D;&#x7684;&#x7070;&#x8272;<em>&#x6807;&#x7B7E;&#xFF08;Tag&#xFF09;</em>&#x5360;&#x4F4D;&#x3002;
&#x591A;&#x9009;&#x9898;&#x6709;&#x591A;&#x4E2A;&#x6B63;&#x786E;&#x9009;&#x9879;&#xFF0C;&#x6B63;&#x786E;&#x9009;&#x9879;&#x5DE6;&#x4FA7;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x5199;&#x7740;&#x201C;&#x6B63;&#x89E3;&#x201D;&#x7684;&#x7EFF;&#x8272;&#x6807;&#x7B7E;&#x3002;
&#x5982;&#x679C;&#x662F;&#x5355;&#x9009;&#x9898;&#xFF0C;&#x6BCF;&#x9053;&#x9898;&#x53EA;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x6B63;&#x89E3;&#x201D;&#x6807;&#x7B7E;&#x3002;
&#x6BCF;&#x9053;&#x9898;&#x90FD;&#x6709;&#x4E00;&#x4E2A;<em>&#x96BE;&#x5EA6;</em>&#x7CFB;&#x6570;&#xFF0C;&#x5176;&#x503C;&#x5728; <code>[0.0, 1.0]</code> &#x533A;&#x95F4;&#x5185;&#xFF0C;
&#x503C;&#x8D8A;&#x5927;&#x8BF4;&#x660E;&#x8BE5;&#x9898;&#x8D8A;&#x96BE;&#xFF1B;&#x5B83;&#x6839;&#x636E;&#x5927;&#x91CF;&#x8003;&#x751F;&#x7684;&#x4F5C;&#x7B54;&#x60C5;&#x51B5;&#x8BA1;&#x7B97;&#x800C;&#x6765;&#xFF0C;&#x5F53;&#x6837;&#x672C;&#x6570;&#x8FC7;&#x5C11;&#x65F6;&#x663E;&#x793A;&#x4E3A;<em>&#x7A7A;</em>&#xFF0C;
&#x4FEE;&#x6539;&#x9898;&#x76EE;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;<em>&#x96BE;&#x5EA6;</em>&#x91CD;&#x7F6E;&#x3002;</p>
<h2 id="&#x7F16;&#x7A0B;&#x9898;">&#x7F16;&#x7A0B;&#x9898;</h2>
<p>&#x7F16;&#x7A0B;&#x9898;&#x7684;<em>&#x7F16;&#x8F91;</em>&#x5BF9;&#x8BDD;&#x6846;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<p><img src="../img/teacher-create-cq.png" alt="cq"></p>
<p>&#x5982;&#x679C;&#x4E0D;&#x52FE;&#x9009;<em>&#x9700;&#x8981;&#x8F93;&#x5165;</em>&#xFF0C;&#x8003;&#x8BD5;&#x65F6;&#x672C;&#x9898;&#x7684;&#x5224;&#x9898;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x8DF3;&#x8FC7;&#x8F93;&#x5165;&#x9636;&#x6BB5;&#x3002;
&#x5426;&#x5219;&#xFF0C;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x586B;&#x5199;<em>&#x8F93;&#x5165;&#x65B9;&#x5F0F;</em>&#x548C;<em>&#x8F93;&#x5165;</em>&#x7684;&#x5185;&#x5BB9;&#xFF0C;
&#x8003;&#x8BD5;&#x65F6;&#x672C;&#x9898;&#x7684;&#x5224;&#x9898;&#x7A0B;&#x5E8F;&#x4F1A;&#x6839;&#x636E;&#x6B64;&#x9898;&#x7684;&#x914D;&#x7F6E;&#x5C06;&#x7ED9;&#x5B9A;&#x5185;&#x5BB9;&#x4EE5;&#x7ED9;&#x5B9A;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x7ED9;&#x8003;&#x751F;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x3002;<em>&#x8F93;&#x51FA;&#x65B9;&#x5F0F;</em>&#x9879;&#x548C;<em>&#x6B63;&#x786E;&#x8F93;&#x51FA;</em>&#x9879;&#x540C;&#x7406;&#xFF0C;
&#x53EA;&#x6709;&#x5F53;&#x8003;&#x751F;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x4E0E;<em>&#x6B63;&#x786E;&#x8F93;&#x51FA;</em>&#x76F8;&#x540C;&#xFF0C;&#x8BE5;&#x8003;&#x751F;&#x624D;&#x80FD;&#x5F97;&#x5206;&#x3002;</p>
<div class="callout callout-warning"><h4 id="&#x4E8B;&#x5148;&#x6D4B;&#x8BD5;&#x7F16;&#x7A0B;&#x9898;">&#x4E8B;&#x5148;&#x6D4B;&#x8BD5;&#x7F16;&#x7A0B;&#x9898;</h4><div><p>&#x7F16;&#x7A0B;&#x9898;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8BBE;&#x7F6E;&#x4E0D;&#x5F53;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x597D;&#x8FDB;&#x884C;&#x4E8B;&#x5148;&#x6D4B;&#x8BD5;&#x3002;
&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8003;&#x8BD5;&#xFF0C;&#x8C03;&#x5927;&#x7F16;&#x7A0B;&#x9898;&#x6570;&#x76EE;&#x4EE5;&#x786E;&#x4FDD;&#x80FD;&#x968F;&#x673A;&#x5230;&#x8981;&#x6D4B;&#x8BD5;&#x7684;&#x9898;&#x76EE;&#xFF0C;
&#x7136;&#x540E;&#x7528;&#x81EA;&#x5DF1;&#x7F16;&#x9020;&#x7684;&#x8003;&#x751F;&#x767B;&#x5F55;&#x5B66;&#x751F;&#x5BA2;&#x6237;&#x7AEF;&#x4F5C;&#x7B54;&#xFF0C;&#x6700;&#x540E;&#x68C0;&#x67E5;&#x6210;&#x7EE9;&#x662F;&#x5426;&#x7B26;&#x5408;&#x9884;&#x671F;&#x3002;</p></div></div>
<p><em>&#x4EE3;&#x7801;&#x521D;&#x59CB;&#x6A21;&#x677F;</em>&#x9879;&#x7684;&#x5185;&#x5BB9;&#x4F1A;&#x4F5C;&#x4E3A;&#x5B66;&#x751F;&#x5BA2;&#x6237;&#x7AEF;&#x8BE5;&#x9898;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x521D;&#x59CB;&#x5185;&#x5BB9;&#x3002;
&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B83;&#x5411;&#x8003;&#x751F;&#x63D0;&#x4F9B;&#x5173;&#x4E8E;&#x672C;&#x9898;&#x7684;&#x63D0;&#x793A;&#xFF08;&#x7528;&#x6CE8;&#x91CA;&#xFF09;&#xFF0C;&#x6216;&#x7ED9;&#x4E88;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x6846;&#x67B6;&#x3002;</p>
<p>&#x5728;&#x8868;&#x683C;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;<em>&#x8F93;&#x5165;</em>&#x4E00;&#x5217;&#xFF0C;&#x5982;&#x679C;<em>&#x8F93;&#x5165;&#x65B9;&#x5F0F;</em>&#x4E3A;<em>&#x4ECE;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;</em>&#xFF0C;
&#x5219;<em>&#x8F93;&#x5165;</em>&#x5185;&#x5BB9;&#x5DE6;&#x4FA7;&#x4F1A;&#x51FA;&#x73B0;&#x5199;&#x6709;<em>&#x6587;&#x4EF6;</em>&#x7684;&#x6807;&#x7B7E;&#xFF1B;&#x82E5;&#x4E3A;<em>&#x4ECE;&#x547D;&#x4EE4;&#x884C;&#x8BFB;&#x53D6;</em>&#xFF0C;
&#x5219;&#x51FA;&#x73B0;&#x5199;&#x6709;<em>&#x547D;&#x4EE4;&#x884C;</em>&#x7684;&#x6807;&#x7B7E;&#xFF1B;&#x5047;&#x5982;&#x6CA1;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x51FA;&#x73B0;&#x5199;&#x6709;<em>&#x65E0;</em>&#x7684;&#x6807;&#x7B7E;&#x3002;
&#x5BF9;&#x4E8E;<em>&#x6B63;&#x786E;&#x8F93;&#x51FA;</em>&#x4E00;&#x5217;&#x540C;&#x7406;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;<em>&#x6B63;&#x786E;&#x8F93;&#x51FA;</em>&#x662F;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;<em>&#x65E0;</em>&#x3002;</p>
<h2 id="&#x586B;&#x7A7A;&#x9898;&#x4E0E;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x9898;">&#x586B;&#x7A7A;&#x9898;&#x4E0E;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x9898;</h2>
<div class="callout callout-danger"><h4 id="&#x586B;&#x7A7A;&#x7684;&#x7B54;&#x6848;&#x8981;&#x6C42;&#x987A;&#x5E8F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;">&#x586B;&#x7A7A;&#x7684;&#x7B54;&#x6848;&#x8981;&#x6C42;&#x987A;&#x5E8F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;</h4><div><p>&#x586B;&#x7A7A;&#x9898;&#x4E0E;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x9898;&#x4F1A;&#x7ED9;&#x8003;&#x751F;&#x4E00;&#x5230;&#x591A;&#x4E2A;&#x7A7A;&#x6765;&#x586B;&#x5199;&#xFF0C;
&#x5224;&#x9898;&#x7A0B;&#x5E8F;&#x6BD4;&#x5BF9;&#x7B54;&#x6848;&#x65F6;&#x8981;&#x6C42;&#x7B54;&#x6848;&#x987A;&#x5E8F;&#x4E25;&#x683C;&#x4E00;&#x81F4;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x5F97;&#x5206;&#x3002;
&#x7528;&#x6237;&#x51FA;&#x9898;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x907F;&#x514D;&#x7B54;&#x6848;&#x987A;&#x5E8F;&#x4EFB;&#x610F;&#x7684;&#x60C5;&#x51B5;&#x3002;</p></div></div>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x9053;&#x9898;&#x51FA;&#x7684;&#x4E0D;&#x597D;&#xFF1A;</p>
<pre class="language-"><code>&#x95EE;&#x9898;&#xFF1A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x662F;__&#x3001;__&#x548C;__&#x3002;
&#x7B54;&#x6848;&#xFF1A;&#x5C01;&#x88C5;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x591A;&#x6001;
</code></pre><p>&#x5047;&#x5982;&#x8003;&#x751F;&#x7B54;&#xFF1A;</p>
<pre class="language-"><code>&#x7EE7;&#x627F;&#x3001;&#x5C01;&#x88C5;&#x3001;&#x591A;&#x6001;
</code></pre><p>&#x5219;&#x53EA;&#x6709;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7A7A;&#x80FD;&#x5F97;&#x5206;&#x3002;
&#x7528;&#x6237;&#x5E94;&#x5F53;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x6216;&#x5F15;&#x5165;&#x5176;&#x4ED6;&#x7EA6;&#x675F;&#x56FA;&#x5B9A;&#x7B54;&#x6848;&#x987A;&#x5E8F;&#x3002;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> Apache-2.0 Licensed | Copyright &#xA9; 2022-present <a href="https://github.com/gonearewe" target="_blank">Euan Mactavish</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> Last Updated 2022-02-28 15:10 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="teachers.html" class="navigation navigation-prev " aria-label="Previous page: 教师管理模块">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="exams.html" class="navigation navigation-next " aria-label="Next page: 考试管理模块">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"试题管理模块","level":"2.7","depth":1,"next":{"title":"考试管理模块","level":"2.8","depth":1,"path":"teacher_guide/exams.md","ref":"teacher_guide/exams.md","articles":[]},"previous":{"title":"教师管理模块","level":"2.6","depth":1,"path":"teacher_guide/teachers.md","ref":"teacher_guide/teachers.md","articles":[]},"dir":"ltr"},"config":{"plugins":["page-footer-ex","zealar","github","bootstrap-callout","-highlight","prism","prism-themes","-lunr","-search","search-pro","splitter","-sharing"],"ignores":["node_modules"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-solarizedlight.css"]},"github":{"url":"https://github.com/gonearewe/EasyTesting"},"page-footer-ex":{"copyright":"Apache-2.0 Licensed | Copyright © 2022-present [Euan Mactavish](https://github.com/gonearewe)","markdown":true,"update_format":"YYYY-MM-DD HH:mm","update_label":"Last Updated"},"splitter":{},"zealar":{},"search-pro":{},"bootstrap-callout":{},"fontsettings":{"theme":"white","family":"sans","size":2},"prism-themes":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Easy Testing Documentation","gitbook":"*"},"file":{"path":"teacher_guide/questions.md","mtime":"2022-02-28T07:10:52.666Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-11T13:08:42.964Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-zealar/test.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

