
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>手册 · Easy Testing Documentation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-zealar/test.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-bootstrap-callout/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../design/introduction.html" />
    
    
    <link rel="prev" href="../teacher_guide/faq.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Welcome!
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">教师用户手册</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../teacher_guide/introduction.html">
            
                <a href="../teacher_guide/introduction.html">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../teacher_guide/deployment.html">
            
                <a href="../teacher_guide/deployment.html">
            
                    
                    部署指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../teacher_guide/login.html">
            
                <a href="../teacher_guide/login.html">
            
                    
                    登录界面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../teacher_guide/structure.html">
            
                <a href="../teacher_guide/structure.html">
            
                    
                    基本界面结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../teacher_guide/students.html">
            
                <a href="../teacher_guide/students.html">
            
                    
                    学生管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="../teacher_guide/teachers.html">
            
                <a href="../teacher_guide/teachers.html">
            
                    
                    教师管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="../teacher_guide/questions.html">
            
                <a href="../teacher_guide/questions.html">
            
                    
                    试题管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="../teacher_guide/exams.html">
            
                <a href="../teacher_guide/exams.html">
            
                    
                    考试管理模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="../teacher_guide/faq.html">
            
                <a href="../teacher_guide/faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">学生用户手册</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="guide.html">
            
                <a href="guide.html">
            
                    
                    手册
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">设计文档</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../design/introduction.html">
            
                <a href="../design/introduction.html">
            
                    
                    系统总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../design/database.html">
            
                <a href="../design/database.html">
            
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../design/api.html">
            
                <a href="../design/api.html">
            
                    
                    接口文档
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../design/server.html">
            
                <a href="../design/server.html">
            
                    
                    服务端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="../design/teacher_client.html">
            
                <a href="../design/teacher_client.html">
            
                    
                    教师客户端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.6" data-path="../design/student_client.html">
            
                <a href="../design/student_client.html">
            
                    
                    学生客户端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.7" data-path="../design/build.html">
            
                <a href="../design/build.html">
            
                    
                    构建指南
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >手册</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x8FD9;&#x662F; Easy Testing &#x5B66;&#x751F;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4F7F;&#x7528;&#x624B;&#x518C;&#x3002;
&#x5B66;&#x751F;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4F9B;&#x5B66;&#x751F;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x7AEF;&#x53C2;&#x52A0;&#x8003;&#x8BD5;&#xFF0C;&#x62E5;&#x6709;&#x8FDB;&#x5EA6;&#x63D0;&#x793A;&#x3001;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x3001;&#x5728;&#x7EBF;&#x8C03;&#x8BD5;&#x7B49;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x65E0;&#x9700;&#x5B89;&#x88C5;&#xFF0C;&#x89E3;&#x538B;&#x7F29;&#x5373;&#x53EF;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#xFF0C;&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#x4E3A;&#x8F6F;&#x4EF6;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x7684; main.exe&#x3002;</p>
<div class="callout callout-warning"><h4 id="&#x4E0D;&#x8981;&#x89E3;&#x538B;&#x5230;&#x542B;&#x4E2D;&#x6587;&#x3001;&#x7A7A;&#x683C;&#x7B49;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x7684;&#x8DEF;&#x5F84;">&#x4E0D;&#x8981;&#x89E3;&#x538B;&#x5230;&#x542B;&#x4E2D;&#x6587;&#x3001;&#x7A7A;&#x683C;&#x7B49;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x7684;&#x8DEF;&#x5F84;</h4><div><p>&#x8F6F;&#x4EF6;&#x65E0;&#x6CD5;&#x5728;&#x542B;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x7684;&#x8DEF;&#x5F84;&#x4E2D;&#x542F;&#x52A8;&#xFF0C;&#x5C3D;&#x91CF;&#x786E;&#x4FDD;&#x8F6F;&#x4EF6;&#x8DEF;&#x5F84;&#x4E2D;&#x4EC5;&#x542B;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x4E0E;&#x6570;&#x5B57;&#x3002;</p></div></div>
<p>&#x5373;&#x4F7F;&#x8003;&#x8BD5;&#x672A;&#x5F00;&#x59CB;&#xFF0C;&#x5B66;&#x751F;&#x4E5F;&#x53EF;&#x8BBF;&#x95EE;&#x767B;&#x5F55;&#x754C;&#x9762;&#xFF0C;&#x6240;&#x4EE5;<strong>&#x5EFA;&#x8BAE;&#x5B66;&#x751F;&#x4E8B;&#x5148;&#x6D4B;&#x8BD5;&#x597D;&#x8F6F;&#x4EF6;&#x80FD;&#x5426;&#x6B63;&#x5E38;&#x6253;&#x5F00;&#xFF0C;&#x4EE5;&#x514D;&#x803D;&#x8BEF;&#x6B63;&#x5F0F;&#x8003;&#x8BD5;</strong>&#x3002;
&#x767B;&#x5F55;&#x754C;&#x9762;&#x6709;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x56DB;&#x9879;&#x8F93;&#x5165;&#x7684;&#x5BF9;&#x8BDD;&#x6846;&#x3002;&#x5176;&#x4E2D;&#x7684;<em>&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;</em>&#x4E0E;<em>&#x8003;&#x8BD5;&#x53F7;</em>&#x5E94;&#x7531;&#x7EC4;&#x7EC7;&#x8003;&#x8BD5;&#x7684;&#x8001;&#x5E08;&#x544A;&#x77E5;&#xFF0C;
&#x5B66;&#x751F;&#x5219;&#x9700;&#x6B63;&#x786E;&#x586B;&#x5199;&#x81EA;&#x5DF1;&#x7684;<em>&#x5B66;&#x53F7;</em>&#x4E0E;<em>&#x59D3;&#x540D;</em>&#x3002;&#x5728;&#x8003;&#x8BD5;&#x5F00;&#x59CB;&#x540E;&#xFF0C;&#x70B9;&#x51FB;<em>&#x767B;&#x5F55;</em>&#x6309;&#x94AE;&#xFF0C;&#x9605;&#x8BFB;&#x5E76;&#x786E;&#x8BA4;&#x5F39;&#x51FA;&#x7684;<em>&#x6CE8;&#x610F;&#x4E8B;&#x9879;</em>&#x5373;&#x53EF;&#x5F00;&#x59CB;&#x8003;&#x8BD5;&#x3002;</p>
<p><img src="../img/student-login.png" alt=""></p>
<p>&#x6CE8;&#x610F;&#x8003;&#x8BD5;&#x65F6;&#x95F4;&#x662F;&#x5F39;&#x6027;&#x7684;&#x3002;&#x8003;&#x8BD5;&#x7684;<em>&#x7ED3;&#x675F;&#x65F6;&#x523B;</em>&#x51CF;<em>&#x5F00;&#x59CB;&#x65F6;&#x523B;</em>&#x4F1A;&#x5927;&#x4E8E;<em>&#x8003;&#x8BD5;&#x9650;&#x65F6;</em>&#xFF0C;&#x5B66;&#x751F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5728;<em>&#x5F00;&#x59CB;&#x65F6;&#x523B;</em>&#x4E0E;<em>&#x7ED3;&#x675F;&#x65F6;&#x523B;</em>&#x95F4;&#x7684;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x8FDB;&#x5165;&#x8003;&#x8BD5;&#xFF0C;
&#x4ED6;&#x7684;&#x7B54;&#x9898;&#x65F6;&#x95F4;&#x5C06;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x5165;&#x65F6;&#x523B;&#x5F00;&#x59CB;&#x8BA1;&#x7B97;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8BD5;&#x5728; 14:00~17:00 &#x8FDB;&#x884C;&#xFF0C;<em>&#x8003;&#x8BD5;&#x9650;&#x65F6;</em>&#x4E3A; 2 &#x5C0F;&#x65F6;&#xFF0C;
&#x90A3;&#x4E48; 14:05 &#x8FDB;&#x5165;&#x8003;&#x8BD5;&#x7684;&#x5B66;&#x751F;&#x5728; 16:05 &#x5C31;&#x4F1A;&#x4EA4;&#x5377;&#xFF0C;&#x800C;&#x56E0;&#x6545;&#xFF08;&#x8FDF;&#x5230;&#x3001;&#x7535;&#x8111;&#x6545;&#x969C;&#x3001;&#x7F51;&#x7EDC;&#x4E0D;&#x597D;&#x7B49;&#xFF09;&#x5728; 15:00 &#x624D;&#x8FDB;&#x5165;&#x8003;&#x8BD5;&#x7684;&#x5B66;&#x751F;&#x5219;&#x53EF;&#x7B54;&#x9898;&#x5230; 17:00&#x3002;
&#x5F53;&#x7136;&#xFF0C;&#x8981;&#x662F;&#x665A;&#x5230; 16:30 &#x624D;&#x8FDB;&#x5165;&#x8003;&#x8BD5;&#xFF0C;17:00 &#x8003;&#x8BD5;&#x4E00;&#x7ED3;&#x675F;&#xFF0C;&#x7167;&#x6837;&#x4E0D;&#x80FD;&#x7EE7;&#x7EED;&#x7B54;&#x9898;&#x3002;
&#x603B;&#x4E4B;&#xFF0C;&#x5B66;&#x751F;&#x5728;&#x5F00;&#x8003;&#x540E;&#x4E0D;&#x5FC5;&#x7740;&#x6025;&#xFF0C;&#x53EF;&#x8010;&#x5FC3;&#x51C6;&#x5907;&#xFF0C;&#x6C89;&#x7740;&#x5E94;&#x8BD5;&#x3002;</p>
<p><img src="../img/exam_timeline.svg" alt=""></p>
<p>&#x8003;&#x8BD5;&#x4E3B;&#x754C;&#x9762;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x8003;&#x8BD5;&#x5206;&#x4E3A; 5 &#x79CD;&#x9898;&#x578B;&#xFF1A;&#x5355;&#x9009;&#x9898;&#x3001;&#x591A;&#x9009;&#x9898;&#x3001;&#x586B;&#x7A7A;&#x9898;&#x3001;&#x5224;&#x65AD;&#x9898;&#x3001;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x9898;&#x4E0E;&#x7F16;&#x7A0B;&#x9898;&#x3002;
&#x5176;&#x4E2D;&#xFF0C;&#x591A;&#x9009;&#x9898;&#x5168;&#x9009;&#x5BF9;&#x5F97;&#x6EE1;&#x5206;&#xFF0C;&#x6F0F;&#x9009;&#x5F97;&#x4E00;&#x534A;&#x5206;&#xFF0C;&#x9519;&#x9009;&#x4E0D;&#x5F97;&#x5206;&#xFF1B;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x9898;&#x8981;&#x6C42;&#x6839;&#x636E;&#x9898;&#x610F;&#xFF0C;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x586B;&#x7A7A;&#xFF1B;&#x7F16;&#x7A0B;&#x9898;&#x7A0D;&#x540E;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;
&#x70B9;&#x51FB;&#x5BF9;&#x5E94;&#x7684;&#x6807;&#x7B7E;&#x5373;&#x53EF;&#x8DF3;&#x8F6C;&#x81F3;&#x8BE5;&#x9898;&#x578B;&#x4F5C;&#x7B54;&#xFF0C;<strong>&#x8003;&#x8BD5;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x9898;&#x76EE;&#x5747;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x987A;&#x5E8F;&#x4F5C;&#x7B54;</strong>&#x3002;
&#x8F6F;&#x4EF6;&#x4F1A;&#x6BCF;&#x9694;&#x4E24;&#x5206;&#x949F;&#x5DE6;&#x53F3;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x4E00;&#x6B21;&#x5B66;&#x751F;&#x7684;&#x7B54;&#x5377;&#xFF0C;&#x4FDD;&#x5B58;&#x6210;&#x529F;&#x65F6;&#x4F1A;&#x5F39;&#x51FA;&#x63D0;&#x793A;&#x3002;&#x5B66;&#x751F;&#x4EA6;&#x53EF;&#x901A;&#x8FC7;&#x70B9;&#x51FB;&#x53F3;&#x4FA7;&#x7684;<em>&#x4FDD;&#x5B58;&#x7B54;&#x5377;</em>&#x6309;&#x94AE;&#x624B;&#x52A8;&#x4FDD;&#x5B58;&#x3002;</p>
<p><img src="../img/student-main.png" alt=""></p>
<p>&#x8F6F;&#x4EF6;&#x53E6;&#x5916;&#x63D0;&#x4F9B;&#x4E86;<em>&#x68C0;&#x67E5;&#x8FDB;&#x5EA6;</em>&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x70B9;&#x51FB;&#x5C31;&#x4F1A;&#x5F39;&#x51FA;&#x7EDF;&#x8BA1;&#x4F5C;&#x7B54;&#x8FDB;&#x5EA6;&#x7684;&#x6D88;&#x606F;&#x6846;&#x3002;&#x5B83;&#x4F1A;&#x63D0;&#x793A;&#x603B;&#x5C0F;&#x9898;&#x6570;&#x4E0E;&#x5DF2;&#x4F5C;&#x7B54;&#x7684;&#x5C0F;&#x9898;&#x6570;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5B66;&#x751F;&#x6F0F;&#x7B54;&#x3002;
&#x6CE8;&#x610F;&#xFF0C;&#x7F16;&#x7A0B;&#x9898;&#x56E0;&#x4E3A;&#x6709;&#x521D;&#x59CB;&#x6A21;&#x677F;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4E0D;&#x7EB3;&#x5165;&#x7EDF;&#x8BA1;&#x3002;</p>
<p><img src="../img/student-progress.png" alt=""></p>
<p>&#x7F16;&#x7A0B;&#x9898;&#x8981;&#x6C42;&#x6839;&#x636E;&#x9898;&#x610F;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x3002;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x80FD;&#x4E3A;&#x547D;&#x4EE4;&#x884C;&#x3001;&#x6587;&#x4EF6;&#x4E24;&#x79CD;&#x8F93;&#x5165;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x3002;
&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x5165;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>input()</code> &#x51FD;&#x6570;&#x8BFB;&#x53D6;&#xFF1B;&#x800C;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x5219;&#x4E3A;&#x7A0B;&#x5E8F;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E0B;&#x7684; input.txt&#xFF0C;
&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>open(&apos;input.txt&apos;, &apos;r&apos;)</code> &#x8BFB;&#x53D6;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x7528; <code>with</code> &#x5173;&#x952E;&#x8BCD;&#x4F5C;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7B49;&#x3002;
&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x7A0B;&#x5E8F;&#x5FC5;&#x6709;&#x8F93;&#x51FA;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E3A;&#x547D;&#x4EE4;&#x884C;&#x3001;&#x6587;&#x4EF6;&#x4E24;&#x79CD;&#x8F93;&#x51FA;&#x4E4B;&#x4E00;&#x3002;&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x51FA;&#x5373;&#x4E3A; <code>print()</code> &#x51FD;&#x6570;&#xFF1B;
&#x800C;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x4E3A;&#x7A0B;&#x5E8F;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E0B;&#x7684; output.txt&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x5E94;&#x65B9;&#x6CD5;&#x5199;&#x5165;&#x6587;&#x672C;&#x3002;<strong>&#x5E94;&#x5F53;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x8F93;&#x51FA;&#x591A;&#x4F59;&#x7684;&#x7A7A;&#x683C;&#x4E0E;&#x56DE;&#x8F66;&#x3002;</strong>
&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x65B9;&#x5F0F;&#x4F1A;&#x5728;&#x9898;&#x5E72;&#x4E0B;&#x65B9;&#x6807;&#x660E;&#x3002;&#x7F16;&#x7A0B;&#x7684;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;<em>&#x8FD0;&#x884C;&#x4EE3;&#x7801;</em>&#x67E5;&#x770B;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x5C06;&#x663E;&#x793A;&#x5728;&#x4E0B;&#x65B9;&#x7684;&#x6587;&#x672C;&#x6846;&#x4E2D;&#xFF0C;
&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3001;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x3001;&#x8D85;&#x65F6;&#x9519;&#x8BEF;&#x7B49;&#x4E5F;&#x4F1A;&#x5728;&#x90A3;&#x663E;&#x793A;&#x3002;
&#x5B66;&#x751F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>print()</code> &#x51FD;&#x6570;&#x6253;&#x5370;&#x4E2D;&#x95F4;&#x53D8;&#x91CF;&#x4EE5;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x7EC8;&#x63D0;&#x4EA4;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x5E94;&#x5F53;&#x6709;&#x7528;&#x4E8E;&#x8C03;&#x8BD5;&#x7684;&#x903B;&#x8F91;&#x3002;</p>
<div class="callout callout-warning"><h4 id="&#x52A1;&#x5FC5;&#x5728;&#x4FDD;&#x5B58;&#x7B54;&#x5377;&#x524D;&#x8FD0;&#x884C;&#x4EE3;&#x7801;">&#x52A1;&#x5FC5;&#x5728;&#x4FDD;&#x5B58;&#x7B54;&#x5377;&#x524D;&#x8FD0;&#x884C;&#x4EE3;&#x7801;</h4><div><p>&#x5C24;&#x5176;&#x6CE8;&#x610F;&#xFF0C;&#x8F6F;&#x4EF6;&#x53EA;&#x4F1A;&#x4FDD;&#x5B58;&#x6700;&#x8FD1;&#x4E00;&#x6B21;<em>&#x8FD0;&#x884C;&#x4EE3;&#x7801;</em>&#x65F6;&#x7684;&#x7ED3;&#x679C;&#x3002;
&#x6240;&#x4EE5;&#xFF0C;&#x5B66;&#x751F;&#x5728;&#x5B8C;&#x6210;&#x6216;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x540E;&#x52A1;&#x5FC5;&#x8981;&#x8FD0;&#x884C;&#x4E00;&#x6B21;&#x3002;</p></div></div>
<p><img src="../img/student-coding.png" alt=""></p>
<p>&#x8F6F;&#x4EF6;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x63D0;&#x524D;&#x4EA4;&#x5377;&#x3002;&#x5982;&#x679C;&#x786E;&#x5B9A;&#x4E0D;&#x518D;&#x4F5C;&#x7B54;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;<em>&#x4FDD;&#x5B58;&#x7B54;&#x5377;</em>&#xFF0C;&#x5F85;&#x6536;&#x5230;&#x6210;&#x529F;&#x63D0;&#x793A;&#x540E;&#x5173;&#x95ED;&#x8F6F;&#x4EF6;&#x5373;&#x53EF;&#x3002;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> Apache-2.0 Licensed | Copyright &#xA9; 2022-present <a href="https://github.com/gonearewe" target="_blank">Euan Mactavish</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> Last Updated 2022-03-06 17:27 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../teacher_guide/faq.html" class="navigation navigation-prev " aria-label="Previous page: FAQ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../design/introduction.html" class="navigation navigation-next " aria-label="Next page: 系统总览">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"手册","level":"3.1","depth":1,"next":{"title":"系统总览","level":"4.1","depth":1,"path":"design/introduction.md","ref":"design/introduction.md","articles":[]},"previous":{"title":"FAQ","level":"2.9","depth":1,"path":"teacher_guide/faq.md","ref":"teacher_guide/faq.md","articles":[]},"dir":"ltr"},"config":{"plugins":["page-footer-ex","zealar","github","bootstrap-callout","-highlight","prism","prism-themes","-lunr","-search","search-pro","splitter","-sharing"],"ignores":["node_modules"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-solarizedlight.css"]},"github":{"url":"https://github.com/gonearewe/EasyTesting"},"page-footer-ex":{"copyright":"Apache-2.0 Licensed | Copyright © 2022-present [Euan Mactavish](https://github.com/gonearewe)","markdown":true,"update_format":"YYYY-MM-DD HH:mm","update_label":"Last Updated"},"splitter":{},"zealar":{},"search-pro":{},"bootstrap-callout":{},"fontsettings":{"theme":"white","family":"sans","size":2},"prism-themes":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Easy Testing Documentation","gitbook":"*"},"file":{"path":"student_guide/guide.md","mtime":"2022-03-06T09:27:35.401Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-12T09:09:20.912Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-zealar/test.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

